app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rollerskating 101"], ["room_number", 14], ["created_at", "2020-03-09 01:56:20.647354"], ["updated_at", "2020-03-09 01:56:20.647354"]]
---
	def create
		@school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 201], ["updated_at", "2020-03-09 02:09:20.999703"], ["id", 1]]
---
    def update
		@school_class.update(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_school_class
        @school_class = SchoolClass.find(params[:id])