app/controllers/students_controller.rb

	def create
		@student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "alice"], ["last_name", "freda"], ["created_at", "2020-03-09 02:34:43.114918"], ["updated_at", "2020-03-09 02:34:43.114918"]]